# Отчёт по лабораторной работе №14 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>М80-108Б-22 Цирулев Николай Владимирович, № по списку 23</ins> 

<b>Контакты e-mail:</b> <ins>mrcirniko@gmail.com</ins>

<b>Работа выполнена:</b> «6» <ins>декабря</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «6» <ins>декабря</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ________________

### 1. Тема
__Вложенные циклы с параметрами. Обход и линеаризация данных.__

### 2. Цель работы
__Научиться составлять программы по обработке квадратных матриц.__

### 3. Задание (Вариант 24)
__Составить программу ввода квдратной матрицы и печати в строку всех ее элементов в заданном порядке.__
 Вариант 22: 
|:---------------:|
| 1  12 11 10 |
| 2  13 16 9  |
| 3  14 15 8  |
| 4  5  6  7 |

### 4. Оборудование
___Прицессор___: AMD Ryzen 5 5500U with Radeon Graphics 2.10 GHz \
___ОП___: 8192 MiB \
___SSD___: 220GB

### 5. Программное обеспечение
___Операционная система семейства___ UNIX, ___наименование___ Ubuntu, ___версия___  20.04 LTS
___Интерпретатор команд___ bash, ___версия___ 5.0.11(1)-release
___Редактор текстов___ nano, ___версия___ 4.8

### 6. Идея, метод, алгоритм решения
__Считаем матрицу в двумерный массив, выведем в нужном порядке__


### 7. Сценарий выполнения работы
1) Создадим функцию ```matInput```, которая будет считывать с клавиатуры элементы матрицы по одному с помощью вложенных циклов.
2) Создадим функцию ```matSolve```, которая будет выводить элементы матрицы в нужном порядке, используя вложенные циклы.
Тесты: 
|  Ввод  | Вывод |
|:------------- | -------------:|
| 3 1 2 3 4 5 6 7 8 9 | 1 4 7 8 9 6 3 2 5 |
| 5 0  1  2  3  4 5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 | 0 5 10 15 20 21 22 23 24 19 14 9 4 3 2 1 6 11 16 17 18 13 8 7 12 |


### 8. Распечатка протокола
```
#include <stdio.h>

enum { maxn = 100 };
void matInput(int n, int (*mat)[n]);
void matSolve(int n, int (*mat)[n]);

int main(void) {
    int mat[maxn][maxn];
    int n;
    scanf("%d", &n);
    matInput(n, (int (*)[n]) mat);
    matSolve(n, (int (*)[n]) mat);
}

void matInput(int n, int (*mat)[n]){
    for (int i = 0; i != n; ++i)
        for (int j = 0; j != n; ++j)
            scanf("%d", &mat[i][j]);
}

void matSolve(int n, int (*mat)[n]){
    int k = n - 1;
    for (int i = 0; i <= n / 2 - 1; ++i) {
        for (int j = i; j <= k - 1; ++j)
            printf("%d ", mat[j][i]);
        for (int j = i; j <= k - 1; ++j)
            printf("%d ", mat[k][j]);
        for (int j = k; j >= i + 1; j -= 1)
            printf("%d ", mat[j][k]);
        for (int j = k; j >= i + 1; j -= 1)
            printf("%d ", mat[i][j]);
        k -= 1;
    }
    if (n % 2 != 0)
        printf("%d\n", mat[n / 2][n / 2]);
}
```
### 9. Дневник отладки

|  Дата    | Время | Событие  | Действие по исправлению |
|:------------- |:---------------:|:---------------:| -------------:|
| 26.11.22 | 11:11 | Выполнение лабораторной работы | |

### 10. Замечания автора по существу работы

### 11. Выводы
Были изучены методы работы с последовательнотями литер входного файла на языке С.

